DROP TABLE IF EXISTS `common_trees`;

CREATE TABLE `common_trees` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

INSERT INTO `common_trees` (`name`) VALUES
('กระถิน'), ('กระถินณรงค์'), ('กระถินเทพา'), ('กระท้อน'), ('กระบก'), ('กระเบา'), ('กระพี้จั่น'), ('กระพี้เขาควาย'), 
('กฤษณา'), ('กล้วยไม้'), ('กะทัง'), ('กะบาก'), ('กะพง'), ('กะหนาน'), ('กัลปพฤกษ์'), ('กาซะลอง'), ('การเวก'), 
('ก้ามปู'), ('กุ่มบก'), ('กุ่มน้ำ'), ('เกด'), ('แก้ว'), ('แก้วเจ้าจอม'), ('โกงกางใบเล็ก'), ('โกงกางใบใหญ่'), 
('โกสน'), ('ขนุน'), ('ขี้เหล็ก'), ('ขี้เหล็กอเมริกัน'), ('เข็ม'), ('เขยตาย'), ('ไข่เน่า'), ('คูน'), ('เคี่ยม'), 
('เคี่ยมคะนอง'), ('แค'), ('แคนา'), ('แคแสด'), ('แคหัวหมู'), ('งิ้ว'), ('เงาะ'), ('จามจุรี'), ('จำปา'), 
('จำปาทอง'), ('จำปาป่า'), ('จำปี'), ('จิก'), ('จิกทะเล'), ('จิกน้ำ'), ('จิกสวน'), ('ชงโค'), ('ชิงชัน'), 
('ชุมแสง'), ('ชำมะเลียง'), ('ซิลเวอร์โอ๊ค'), ('ตะกู'), ('ตะโก'), ('ตะโกนา'), ('ตะคร้อ'), ('ตะเคียน'), 
('ตะเคียนทอง'), ('ตะเคียนหนู'), ('ตะเคียนหิน'), ('ตะแบก'), ('ตะแบกนา'), ('ตาล'), ('ตีนเป็ด'), ('ตีนเป็ดน้ำ'), 
('ตีนเป็ดฝรั่ง'), ('เต็ง'), ('เตยเบน'), ('เติม'), ('แต้ว'), ('ทรงบาดาล'), ('ทองกวาว'), ('ทองหลาง'), 
('ทองอุไร'), ('ทัง'), ('ทับทิม'), ('ทุเรียน'), ('เทพทาโร'), ('เทียนหยด'), ('ไทร'), ('ไทรย้อย'), ('ไทรย้อยใบแหลม'), 
('ธนนไชย'), ('นนทรี'), ('น้อยหน่า'), ('นิรพาน'), ('บุนนาค'), ('บุหงาส่าหรี'), ('ประดู่'), ('ประดู่แดง'), 
('ประดู่บ้าน'), ('ประดู่ป่า'), ('ปอทะเล'), ('ปอสา'), ('ปาล์ม'), ('ปาล์มขวด'), ('ปาล์มหางกระรอก'), ('ปีบ'), 
('ปีบทอง'), ('ผกา'), ('ผักหวาน'), ('ผักหวานป่า'), ('ไผ่'), ('ไผ่ตง'), ('ไผ่รวก'), ('ไผ่เลี้ยง'), ('ไผ่สีสุก'), 
('ฝรั่ง'), ('พญาไร้ใบ'), ('พญาสัตบรรณ'), ('พยอม'), ('พะมร'), ('พะยูง'), ('พะวา'), ('พลับ'), 
('พลับพลา'), ('พวงคราม'), ('พวงแสด'), ('พิกุล'), ('โพ'), ('โพทะเล'), ('โพธิ์'), ('ไพล'), ('ฟัง'), 
('มะค่า'), ('มะค่าแต้'), ('มะค่าโมง'), ('มะเกลือ'), ('มะขาม'), ('มะขามเทศ'), ('มะขามป้อม'), ('มะตาด'), 
('มะตูม'), ('มะทราง'), ('มะนาว'), ('มะพร้าว'), ('มะพลับ'), ('มะไฟ'), ('มะม่วง'), ('มะม่วงป่า'), ('มะม่วงหิมพานต์'), 
('มะยงชิด'), ('มะยม'), ('มะริด'), ('มะสัง'), ('มะหาด'), ('มะฮอกกานี'), ('มันปู'), ('มังคุด'), ('มัลเบอร์รี่'), 
('มาง'), ('มาร์ก'), ('มิกกี้เม้าส์'), ('โมก'), ('โมกมัน'), ('โมกหลวง'), ('โมกใหญ่'), ('ไม้แดง'), ('ไม้เต็ง'), 
('ไม้รัง'), ('ไม้สัก'), ('ยอ'), ('ยอหมู'), ('ยาง'), ('ยางนา'), ('ยางพารา'), ('ยางโอน'), ('ยูคาลิปตัส'), 
('โยทะกา'), ('รกฟ้า'), ('รัง'), ('ราชพฤกษ์'), ('รำเพย'), ('รุ่ย'), ('ลาน'), ('ลำดวน'), ('ลำพู'), 
('ลิ้นจี่'), ('ลูกหยี'), ('เล็บมือนาง'), ('สน'), ('สนฉัตร'), ('สนทะเล'), ('สนประดิพัทธ์'), ('สนสามใบ'), 
('สมอ'), ('สมอไทย'), ('สมอพิเภก'), ('ส้มโอ'), ('สัก'), ('สักทอง'), ('สาเก'), ('สาธร'), ('สารภี'), 
('สำโรง'), ('สีเสียด'), ('สีเสียดแก่น'), ('เสลา'), ('แสงจันทร์'), ('โสก'), ('โสกน้ำ'), ('โสกพวง'), 
('โสกเหลือง'), ('หงอนไก่'), ('หนาด'), ('หมัน'), ('หยี'), ('หลุมพอ'), ('หอม'), ('หว้า'), ('หวาย'), 
('หางนกยูงฝรั่ง'), ('หางนกยูงไทย'), ('หูการ่าง'), ('หูกวาง'), ('หูหนู'), ('เหรียง'), ('เหลืองปรีดียาธร'), 
('อบเชย'), ('อ้อยช้าง'), ('อินทนิล'), ('อินทนิลน้ำ'), ('อินทนิลบก'), ('อินทผลัม'), ('เอื้อง'), ('แอ๊ปเปิ้ล');
